
#include "../Internal.h"
#include <Lumino/Base/GeometryStructs.h>

LN_NAMESPACE_BEGIN

//==============================================================================
// PointI
//==============================================================================
const PointI	PointI::Zero(0, 0);

//==============================================================================
// PointF
//==============================================================================
const PointF	PointF::Zero(0, 0);

//==============================================================================
// Size
//==============================================================================

template<typename T> const GenericSize<T> GenericSize<T>::Zero(0, 0);
template<typename T> const GenericSize<T> GenericSize<T>::MinValue(std::numeric_limits<T>::min(), std::numeric_limits<T>::min());
template<typename T> const GenericSize<T> GenericSize<T>::MaxValue(std::numeric_limits<T>::max(), std::numeric_limits<T>::max());

// テンプレートのインスタンス化
template class GenericSize<int>;
template class GenericSize<float>;

//==============================================================================
// RectI
//==============================================================================
const RectI	RectI::Zero(0, 0, 0, 0);
const RectI	RectI::Empty(0, 0, -1, -1);

//==============================================================================
// RectF
//==============================================================================
const RectF	RectF::Zero(0, 0, 0, 0);
const RectF	RectF::Empty(0, 0, -1, -1);

//==============================================================================
// Box32
//==============================================================================
const Box32 Box32::Zero(0, 0, 0, 0, 0, 0);

//==============================================================================
// ThicknessF
//==============================================================================
const ThicknessF	ThicknessF::Zero(0, 0, 0, 0);

LN_NAMESPACE_END
