//=============================================================================
// [メインページ]
//=============================================================================
/**
	@mainpage   Lumino.Core
	
	Lumino.Core は、C++ によるアプリケーション開発を支援するためのユーティリティクラスライブラリです。
	文字列、動的配列、ファイルI/O、文字コード変換、XML などの、ユーザーインターフェイスから独立した多数の機能を提供しています。
	
	@section Main1_sec1 トピック

	- @subpage Intro1 <br>
	<br>
	- @subpage Install1 <br>
	<br>
	- @subpage Reference1 <br>
	<br>
	- @subpage DevGuide1 <br>
	<br>
	- @subpage License1 <br>

*/
//=============================================================================
